/***************************Copyright BestFu ***********************************
**  文    件：  EXTIx.c
**  功    能：  外部中断驱动
**  编    译：  Keil uVision5 V5.10
**  芯    片：  STM32L151
**  版    本：  V1.0
**  编    写：  jay
**  创建日期：  2016-05-12
**  修改日期：  无
**  说    明：  
**  V1.0
    >> 
*******************************************************************************/
#include "sys.h"
#include "gpio.h"
#include "EXTIx.h"
#include "key.h"

/*******************************************************************************
**函    数:  void EXTI_Init(void)
**功    能:  外部中断初始化
**参    数:  null
**返    回:  null
**说    明： 无         
********************************************************************************/
void EXTI_Init(void)
{
//	GPIOx_Cfg(GPIO_A,pin_0,IN_ANALOG);
	Ex_NVIC_Config(GPIO_A,0,RTIR); 
	MY_NVIC_Init(2, 1, EXTI0_IRQn, 2);	 
}

/*******************************************************************************
**函    数:  void EXTI_Init(void)
**功    能:  外部中断初始化
**参    数:  null
**返    回:  null
**说    明： 无         
********************************************************************************/
void Set_EXTI_Trigger(u8 TRIM) 
{
 	if(TRIM&0x01)
	{
		EXTI->RTSR&=~(1<<0);//line BITx上事件上升降沿触发
		EXTI->FTSR|=1<<0;//line BITx上事件下降沿触发
	}	
	if(TRIM&0x02)
	{
		EXTI->RTSR|=1<<0;//line BITx上事件上升降沿触发
		EXTI->FTSR&=~(1<<0);//line BITx上事件下降沿触发
	}
}


/*******************************************************************************
**函    数： EXTI0_IRQHandler
**功    能： 外部唤醒中断
**说    明： 
*******************************************************************************/
void EXTI0_IRQHandler(void)
{  
    KeyEXTIHandle();
	EXTI->PR = 1<<0;  //清除LINE0上的中断标志位 
}

/********************************* END FILE ***********************************/
