/***************************Copyright BestFu ***********************************
**  文    件：  WTC6216.c
**  功    能：  <<驱动层>> WTC6216 十六通道电容触摸芯片
**  编    译：  Keil uVision5 V5.10
**  版    本：  V1.0
**  编    写：  Seven
**  创建日期：  2014.08.20
**  修改日期：  2014.08.20
**  说    明：  数据接口: INT_Flag线 + 四线BCD码
*******************************************************************************/
#include "WTC6216.h"
#include "LowPower.h"

/*******************************************************************************
**函    数:  WTC6216_Init()
**功    能:  WTC6216初始化
**参    数:  null
**返    回:  null
*******************************************************************************/
void WTC6216_Init(void)
{
    GPIOx_Cfg(PORT_WTC_TouchFlag, PIN_WTC_TouchFlag, IN_DOWN);
    GPIOx_Cfg(PORT_WTC_DATA     , DATA0|DATA1|DATA2|DATA3, IN_FLOATING);
}
/*******************************************************************************
**函    数:  WTC6216_Output_Init()
**功    能:  WTC6216初始化
**参    数:  null
**返    回:  null
*******************************************************************************/
void WTC6216_Output_Init(void)
{
    GPIOx_Cfg(PORT_WTC_DATA, DATA0|DATA1|DATA2|DATA3, OUT_PU_400K);
}
/*******************************************************************************
**函    数:  WTC6216_Read()
**功    能:  WTC6216读取摁键值
**参    数:  null
**返    回:  摁键值
             无摁键返回 0xff
*******************************************************************************/
u8 WTC6216_ReadKey(void)   
{
//    if(0 != Get_TouchFlag())
//    {
        return Get_TouchKey();
//    }
//    return 0xff;
}
/*******************************************************************************
**函    数:  WTC6216_WriteKey()
**功    能:  WTC6216写灵敏度
**参    数:  null
**返    回:  null
             无摁键返回 0xff
*******************************************************************************/
void WTC6216_WriteKey(void)   
{
	Put_TouchKey();
}
/*******************************************************************************
**函    数:  Config_Wtc6216()
**功    能:  WTC6216配置灵敏度
**参    数:  null
**返    回:  null
*******************************************************************************/
void Config_Wtc6216(void)
{
	WTC6216_Output_Init();
	Put_TouchKey();
	WTC6216_Init();
	Get_TouchKey();
}
/********************************* END FILE ***********************************/
